In [3]:
import pandas as pd
var = pd.DataFrame({'a':[1,2,3,4,5],'b':[6,7,8,9,10]})
print(var)

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [7]:
var['c']=var['a']+var['b']
var

   a   b   c
0  1   6   7
1  2   7   9
2  3   8  11
3  4   9  13
4  5  10  15

In [9]:
var['c']=var['a']-var['b']
var

   a   b  c
0  1   6 -5
1  2   7 -5
2  3   8 -5
3  4   9 -5
4  5  10 -5

In [11]:
var['c']=var['a']*var['b']
var

   a   b   c
0  1   6   6
1  2   7  14
2  3   8  24
3  4   9  36
4  5  10  50

In [13]:
var['c']=var['a']/var['b']
var

   a   b         c
0  1   6  0.166667
1  2   7  0.285714
2  3   8  0.375000
3  4   9  0.444444
4  5  10  0.500000

In [17]:
import pandas as pd
var1 = pd.DataFrame({'a':[10,20,30,4,5],'b':[6,70,80,9,10]})
print(var1)

    a   b
0  10   6
1  20  70
2  30  80
3   4   9
4   5  10

In [21]:
var['Python']= var['a']>=30
var['Python']= var['b']<=30

var

    a   b  Python
0  10   6    True
1  20  70   False
2  30  80   False
3   4   9    True
4   5  10    True